<!DOCTYPE html>
<html lang="en">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>Solongdy</title>
    <style>
        body {
            font-family: Khmer OS Siemreap !important;
        }

        div {
            display: flex;
            align-items: center;
            gap: 0 1rem;
        }

        label,
        input,
        button,
        p {
            display: block;
            font-size: 20px;
            padding: 10px;
            font-family: Khmer OS Siemreap !important;
        }

        button {
            background: rgba(0, 128, 0, 0.7);
            color: white;
            border: none;
            padding: 14px;
            cursor: pointer;
        }

        form::after {
            content: "";
            width: 100%;
            height: 15px;
            background: rgba(0, 128, 0, 0.7);
            margin-top: 2rem;
            display: block;
        }

        .btn-container> :nth-child(1) {
            background: dodgerblue;
        }

        .btn-container> :nth-child(2) {
            background: red;
        }

        .btn-container> :nth-child(3) {
            background: gray;
        }

        .btn-container> :nth-child(4) {
            background: pink;
        }

        .btn-container> :nth-child(5) {
            background: black;
        }

        .btn {
            margin-top: 2rem;
        }
    </style>
</head>

<body>
    <?php
    $n = isset( $_POST[ "text" ] ) ? $_POST[ "text" ] : "";
    ?>
    <h1>តម្រាទាយតាមឈ្មោះ</h1>
    <form method="post">
        <div class="form">
            <label for="date">បញ្ចូលឈ្មោះ : </label>
            <input type="text" name="text" value="<?php echo "$n"; ?>">
            <button type="submit" name="submit">Ok</button>
        </div>
        <div class="btn-container">
            <button class="btn" name="btnPersonality">លក្ខណៈសម្បត្តិ</button>
            <button class="btn" name="btnSelf">បុគ្គលភាព</button>
            <button class="btn" name="btnLove">ស្នេហា និង អាពាហ៍ពិពាហ៍</button>
            <button class="btn" name="btnJob">ការងារនិងទំនាក់ទំនង</button>
            <button class="btn" name="btnMoney">លុយកាក់និងទ្រព្យសម្បត្តិ</button>
        </div>
    </form>
    <?php

    //Objects
    $obj = [ 
        new Fortune(
            1,
            "សម្បូរដោយសេចក្ដីក្លាហាន និង គំនិតផ្សងព្រេងគំនិតអារកាត់ខ្លាំងឯកច្ឆន្ទ ។ ជាទូទៅច្រើនប្រកបដោយការឆ្មើងឆ្មៃយ៉ាងមាំទាំ និង ថាមពលខាងចរិយាដ៏ធំចំពោះសត្រូវ ។ ជាមនុស្សកើតមកសម្រាប់ធ្វើជាមេគេ ឬក៏ជាអ្នកល្បីល្បាញបើប្រសិនជាគ្មានកាលៈទេសៈអ្វីមកខ្ទាស់ការរីកចំរើន ខាងផ្លូវគំនិតរបស់គេទេ ។",
            "ជាមនុស្សមានគំនិតថ្លៃថ្នូរ  ហើយខ្ពង់ខ្ពស់ព្រមទាំងប្រកបដោយប្រាជ្ញាឈ្លាសវៃ ប្លែកពីគេ ។ ជាអ្នកតែងធ្វើឱ្យគេចាប់អារម្មណ៍មកលើខ្លួនហើយច្រើនកាន់កាប់ មុខងារធំដុំនៅកន្លែងធ្វើការ ។ ដោយហេតុជនជំពូកលេខ១នេះមានបុគ្គលភាព ត្រចះត្រចង់ជននេះក៏ក្លាយជាអ្នកមានវាសនាខាងធ្វើអោយមានអ្នកកោត សរសើរខ្លួនច្រើន មិត្ដភក្ដិក៏ច្រើន តែសត្រូវក៏ច្រើនដែរ ។",
            "ជន ជំពូកលេខ ១មានទំនោរចិត្ដជាអ្នកត្រួតត្រាហើយចូលចិត្ដបញ្ជាលើមនុស្ស ដែលខ្លួនជ្រើសរើសជាគូគាប់ណាស់ ។ ច្រើនមានចិត្ដប្រច័ណ្ឌមិនព្រមឱ្យគូគាប់ របស់ខ្លួនមានចិត្ដវៀចវេរទេ ។ បើរៀបការជាមួយមនុស្សជំពូកលេខ២ និង លេខ៦ទើបល្អ ។ មិនសូវល្អជាមួយនឹង៥ ឬលេខ៧ ព្រោះច្រើនទាស់ទែងគ្នា ។",
            "ជាមនុស្សដែល កើតមកសម្រាប់តែបានទទួលជោគជ័យក្នុងអ្វីៗដែលខ្លួនកាន់កាប់ ។ ថ្វីបើគេជាអ្នកមានគំនិតខាងការបង្កើត ហើយពិចារណាច្រើនក្ដី មនុស្ស ជំពូកលេខ១ ធ្វើការក្នុងរដ្ឋបាលក៏ពូកែ រត់ការក៏ពូកែ ។ តែទោះជាធ្វើការអ្វីក៏ ដោយមនុស្សនេះត្រូវកាន់កាប់ការនោះតែម្នាក់ឯង ឬធ្វើជាមេគេទើបស្រប តាមវាសនារបស់គេ ។ តាមពិតទៅថ្វីបើគេជាអ្នកធ្វើការដោយស្វិតស្វាញ និង មនសិការមនុស្សជំពូកលេខ១មិនចូលចិត្ដស្ថិតនៅក្រោមឱវាទគេទេ ។ ក្នុងទំនាក់ទំនងជាមួយចៅហ្វាយនាយរបស់ខ្លួនមនុស្សជំពូកលេខ១ច្រើន ចូលចិត្ដកាត់ណាស់ ។",
            "មនុស្សជំពូក លេខ១ប្រសប់ប្រកបរបរណាស់ហើយតែងរកចំណេញបានច្រើនផង ។ តែជាអកុសលរកបានប៉ុន្មាន ចាយអស់ប៉ុណ្ណឹង បើនិយាយឱ្យខ្លី គឺរកក៏ធូរ ចាយក៏ធូរ ។",
        ),
        new Fortune(
            2,
            "មានចរិតជាអ្នកឆាប់រំភើបបំផុតឆាប់ខឹង តែចូលចិត្ដគោរព អ្នកដទៃ ។ ជាអ្នកចេះស្ដាប់បង្គាប់ ចូលចិត្ដឱ្យគេដឹកនាំជាជាងបញ្ជាគេ ។ មនុស្សជំពូកនេះ ពេញចិត្ដនឹងការរាក់ទាក់រាប់អានណាស់ ហើយតែងតែខិតខំ បំពេញបំណងជនដែលមកសុំជំនួយពីខ្លួន ។",
            "ដោយខ្លួនជាអ្នករាក់ទាក់មនោសញ្ចេតនាចូលចិត្ដនិយាយរឿងផ្ទាល់ខ្លួនប្រាប់គេមនុស្សជំពូកលេខ២ តែងបណ្ដោយខ្លួនទៅតាមទឹកចិត្ដ ជាជាងទៅតាម វិចារណញ្ញាណ នៅពេលខ្លួនក្ដាប់ស្ថានការណ៍បានហើយក្ដី ក៏មនុស្សជំពូក លេខ២តែងតែនៅមានការរំភើបជានិច្ចនៅពេលដែលខ្លួនជួបប្រទះនឹងការ លំបាក ។ ដោយខ្លួនមិនសូវចេះរស់ក្នុងជីវភាពសង្គមមនុស្សនេះចូលចិត្ដរស់នៅ តែឯកឯងព្រោះស្អប់បរិយាកាសអាប់អួរណាស់ ។",
            "មនុស្សជំពូកលេខ២ច្រើនជាស្វាមីឬភរិយាគ្រប់លក្ខណ៍ ។ ការពិតមនុស្ស ជំពូក នេះដោយអាស្រ័យលើទឹកចិត្ដសណ្ដោសនិងមនោសញ្ចេតនារបស់ខ្លួនតែងប្រឹង ប្រែងផ្ដល់ឱ្យគូគាប់របស់ខ្លួននូវសុខុមាលភាពនិងសុភមង្គល ។ មានពេលខ្លះទោះ ជានៅចំពោះមុខសីលធម៌ឬក៏ប្រាកដនិយមដែលជាការចាំបាច់សម្រាប់ការរស់ នៅក្ដីក៏មនុស្សជំពូកនេះ មិនចោលភាពអណ្ដែតអណ្ដូងរបស់ខ្លួនដែរ ។ បើរៀបការជាមួយមនុស្សជំពូកលេខ៤ និងលេខ៦ ទើបល្អ ។ តែជាមួយលេខ៨ និងលេខ៩ ក៏ល្អដែរ ព្រោះមានលក្ខណៈប្រហែលគ្នា ។",
            "ជាមនុស្សគិតច្រើននិងមានគំនិតបង្កើតតែកង្វះខាងភាពឈ្លានពានរបស់មនុស្សនេះ តែងនាំឱ្យមនុស្សជំពូកនេះចូលចិត្ដធ្វើជាចិត្ដវិទូជាឧបការីសង្គមនិងជា លេខាធិការដ៏មានប្រសិទ្ធភាព ។ សរុបសេចក្ដីទៅគឺជាមនុស្សដែលកើតមក សម្រាប់តែទទួលជោគជ័យក្នុងវិជ្ជាជីវៈណាដែលតម្រូវឱ្យមានមនសិការវិជ្ជា ជីវៈនិងការឱហាតក្នុងកិច្ចការ ។",
            "ជាអ្នកសន្សំប្រាក់ផុតលេខហើយមិនចូលចិត្ដខាតបង់លុយកាក់ទទេៗក្នុងមុខរបរមានគ្រោះថ្នាក់ឬមិនជាក់ច្បាស់ឡើយ ។ គឺចូលចិត្ដយកលុយទៅរកស៊ីដោយមាន បែបផែន ហើយមិនចូលចិត្ដលេងល្បែងស៊ីសងទេ ។ ប៉ុន្ដែដោយខ្លួនជាអ្នកចិត្ដល្អពីធម្មជាតិមកនោះមនុស្សជំពូកនេះហ៊ានចំណាយទៅលើមនុស្សដែលខ្លួនស្រឡាញ់ដោយឥឥតញញើតដៃទេ ។",
        ),
        new Fortune(
            3,
            "ជាមនុស្សពោរពេញដោយថាមពលនិងគំនិតបង្កើតស្រឡាញ់ជីវភាពតាមគ្រប់លក្ខណៈហើយអ្វីក៏អាចទាក់ចិត្ដគេបានដែរ ។ ជាអ្នកសុទិដ្ឋិនិយម និង ទុកចិត្ដខ្លួនឯង ។ ចេះភ្លក់រសជាតិនៃការសប្បាយនៃជីវិតហើយចេះទទួលទិដ្ឋិភាពជា វិជ្ជមានក៏ដូចជាទិដ្ឋិភាពមិនសូវសប្បាយដែរ ។ រហ័សរហួន ហើយឆាប់ទទួល ឥទ្ធិពលពីគេ ដូចមនុស្សឯទៀតដែរ តែក៏ឆាប់ជួបនឹងវិបត្ដិផ្លូវចិត្ដដែរ ។",
            "ចូលចំណោមឆាប់ចុះរហូតដល់គេអាចនិយាយបានថាមនុស្សជំពូកលេខ៣នេះគឺជាមនុស្សងាយសម្របតាមជីវភាពក្នុងសហគមន៍បំផុត ។ ជាអ្នកចេះទប់ចិត្ដបានយ៉ាងត្រចះត្រចង់ហើយយ៉ាងសប្បាយទៀតរួចចេះធ្វើឱ្យអ្នកផងពេញចិត្ដគ្រប់ៗគ្នា ។ អ៊ីចឹងហើយបានជាមនុស្សនេះងាយរកមិត្ដភាពពី អ្នកដទៃណាស់ ។ បានជាឆាប់ទទួលការរាប់អានដូច្នេះព្រោះមនុស្សជំពូកលេខ៣មិនចូលចិត្ដចោទបញ្ហាច្រើនទេព្រោះខ្លាចការរស់នៅដោយសប្បាយឆាប់បាត់បង់ទៅវិញ ដូចដែលខ្លួនងាយរកបានមក ។",
            "ថ្វីបើមនុស្សជំពូកលេខ៣ជាអ្នកមានទឹកចិត្ដទោរទន់ក៏ដោយក៏នៅមុនពេលរកគូស្រករមនុស្សនេះចូលចិត្ដធ្វើពិសោធន៍ចិត្ដគូគាប់របស់ខ្លួនមុនជានិច្ច ។ លុះរៀបការហើយមនុស្សនេះតែងខិតខំបំពេញចិត្ដគូគាប់និងកូនចៅរបស់ខ្លួនណាស់ ។ យកល្អត្រូវរៀបការនឹងមនុស្សជំពូកលេខ៣ដូចគ្នា និងលេខ៨ ។",
            "ដោយមានការរហ័សរហួន និងគំនិតផ្ដើមពីធម្មជាតិមកស្រាប់មនុស្សនេះចូលចិត្ដ ប្រកបរបរណាដែលខ្លួនអាចបង្ហាញឱ្យឃើញនូវការប៉ិនប្រសប់ និងគំនិតផ្ដួចផ្ដើម របស់ខ្លួនណាស់ ។ បើធ្វើជាអ្នកកាសែតអ្នកថតរូបវិចិត្រករ គឺប្រសើរណាស់ ព្រោះអាចបានទទួលជោគជ័យច្រើន ។ ម្យ៉ាងទៀតមុខរបរខាងការផ្សាយខាងទំនាក់ទំនងសាធារណៈ ពោលឱ្យខ្លី គឺឱ្យតែមុខរបរណាមានទំនាក់ទំនងនឹងមនុស្សដទៃច្រើន មនុស្សជំពូកលេខ៣ ប្រសប់ធ្វើឱ្យបានជោគជ័យបំផុត ។",
            "ជាមនុស្សចិត្ដល្អហើយចាយធំផង ។ ចូលចិត្ដធ្វើម៉េចឱ្យតែអ្នកមកជួបនឹងខ្លួនបានសប្បាយចង់អស់ប៉ុន្មានក៏អស់ទៅ ព្រោះចូលចិត្ដគិតថា លុយមិនមែនធ្វើមកសម្រាប់តែសន្សំ តែសម្រាប់ចាយ ឱ្យបានសប្បាយចិត្ដ ។",
        ),
        new Fortune(
            4,
            "ជាអ្នកធ្វើការមិនខ្លាចនឿយហត់ប្រកបដោយគំនិតម៉ឺងម៉ាត់និងប្រាកដនិយម ។ មនុស្សជំពូកលេខ៤ស្រឡាញ់វិជ្ជាជីវៈរបស់ខ្លួនណាស់ ។ ជាទូទៅ ដោយអាស្រ័យលើគុណសម្បត្ដិពិសេសរបស់ខ្លួនជាអ្នករៀបចំ និងដឹកនាំ មនុស្សនេះ ច្រើនទទួលជោគជ័យជានិច្ចក្នុងកិច្ចការ ។ គុណសម្បត្ដិពិសេសរបស់មនុស្សជំពូកលេខ៤គឺមនៈសិការក្នុងវិជ្ជាជីវៈ ការទៀងទាត់ និងការឱហាត។",
            "ជាអ្នកប្រយ័ត្នប្រយែង ហើយគត់មត់ ។ មិនងាយប្រព្រឹត្ដអំពើផ្ដេសផ្ដាសទេ ព្រោះជាមនុស្សមានស្មារតីម៉ឺម៉ាត់ មិនចេះរវើរវាយ ។ គឺជាមិត្ដភក្ដិដ៏ប្រសើរ ខាងស្មោះត្រង់បំផុតតែមិនពូកែខាងប្រើទឹកមុខទេហើយឆាប់ខឹងណាស់ ។ បើនឹងជឿលើរឿងអ្វីមួយគឺទាល់តែពិចារណាហ្មត់ចត់ណាស់តែបើទុកចិត្ដហើយទោះត្រូវធ្វើអ្វីក៏ធ្វើដែរ ឱ្យតែមនុស្សដែលខ្លួនស្រឡាញ់នោះបានពេញចិត្ដ ។",
            "មនុស្សជំពូកលេខ៤ មិនងាយចាប់ចិត្ដស្រឡាញ់គេងាយៗទេ ហើយបើនឹងរៀបការជាមួយអ្នកណាម្នាក់វិញ ទាល់តែបានសង្កេតមើលចិត្ដថ្លើមអស់ចិត្ដអស់ចង់ ។ គឺជាភរិយាឬស្វាមីដ៏ប្រសើរប្រកបដោយគំនិតទទួលខុសត្រូវ និងសីលធម៌ ។ និយាយឱ្យខ្លីទៅបើលោកអ្នកចង់រកគូស្រករជាអ្នករវើរវាយហើយល្ងង់ខ្លៅសូមកុំយកមនុស្សជំពូកលេខ៤នេះឱ្យសោះ ។ មនុស្សនេះ បើរៀបការជាមួយនឹង មនុស្សជំពូកលេខ៤, ៧ និង ៩ គឺប្រសើរណាស់ ព្រោះរវាងគ្នានឹងគ្នា មានភាពស្របខាងប្រាជ្ញាច្រើនណាស់ ។",
            "ដោយមានធម្មជាតិជាអ្នកស្រឡាញ់ការសិក្សាមនុស្សជំពូកលេខ៤មាននិស្ស័យ ខាងកិច្ចការណាដែលមានទ្រឹស្ដី ជាអាទ៍ ។ គេច្រើនជាគណិតវិទូអ្នកស្រាវជ្រាវ វិស្វករ និងសាស្ដ្រាចារ្យ ។ ជាទូទៅមុខរបររបស់គេមិនហុចជោគជ័យឱ្យឃើញ ភ្លាមៗទេ ។ តែបើនឹងចាប់កិច្ចការអ្វីមួយហើយអ្នកដែលស្គាល់គេតែងសរសើរ ព្រមទាំងសង្ឃឹមលើគេ ជានិច្ច ។",
            "មនុស្សជំពូកលេខ៤ប្រើលុយកាក់ដោយប្រយ័ត្នប្រយែងណាស់ហើយមិនស្រប រកស៊ីក្នុងមុខរបរណាដែលអាចមានកំហាតបង់ទេ ។ គេចូលចិត្ដសន្សំលុយហើយពូកែទុកដាក់បំផុត ។ ស្ថានភាពហិរញ្ញវត្ថុរបស់គេ ច្រើនតែមាំទាំ ។ គេមិនមែនជាមនុស្សកំណាញ់ទេតែបើនឹងចាយវាយគឺគេចាយ តែលុយណាដែលគេយល់ថាអាចចាយបាន ។",
        ),
        new Fortune(
            5,
            "មានទំនោរចិត្ដជាអ្នកស្វាហាប់រហ័សរហួនប្រកបដោយ ថាមពល ។ ដោយមានគំនិតផ្សងព្រេងជានិស្ស័យមនុស្សនេះស្រឡាញ់សេរីភាពណាស់ហើយដើម្បីសេរីភាពមនុស្សនេះមិនញញើតនឹងលះបង់អ្វីៗគ្រប់យ៉ាង ។ គ្មានអ្វីដែលថាធ្វើទៅមិនកើតសម្រាប់មនុស្សនេះទេហើយការណាដែលគេថា មិនអាចធ្វើបាន មនុស្សនេះចូលចិត្ដធ្វើបំផុត ។ គឺជាមនុស្សពិបាកបំផុតហើយ ហ៊ានប្រយុទ្ធនឹងគ្រោះថ្នាក់បំផុតដែរ ។ គេជាអ្នកសុទិដ្ឋិនិយម មានការត្រង់ ត្រាប់ដែលមិនអាចបំបែកបាន គឺគុណសម្បត្ដិទាំងនេះ ហើយដែលញ៉ាំងឱ្យគេ ពុះពារឧបសគ្គគ្រប់បែបយ៉ាងបានដោយងាយ ។",
            "ហ៊ានអារកាត់ដោយឥតរារែក គឺគេជាមនុស្សក្នុងជំពូកអ្នកដែលហ៊ានសំរេច កិច្ចការ ដោយមិនសូវគិតច្រើន ។ គេជាអ្នកប្រកបដោយគំនិតភ្លឺស្វាង និង គួរឱ្យទាក់ចិត្ដនៅក្នុងសង្គម ។ បើនិយាយឱ្យសាមញ្ញគឺស៊ីដាច់គេដាច់ឯងតែម្ដង មិត្ដភក្ដិក៏ច្រើនអ្នកសើចសរសើរក៏ច្រើនទៀត ។ ក៏ប៉ុន្ដែជនជំពូកលេខ៥ ក៏ជាមនុស្សមិនចេះអត់ធ្មត់ ហើយឆាប់ខឹងផងតែគឺជាគុណវិបត្ដិដែលអាចឱ្យ អធ្យាស្រ័យបានព្រោះមនុស្សនេះចេះធ្វើឱ្យគេរាប់អានណាស់ ។",
            "ដោយគេជាអ្នកឆ្លាតឆ្លុំក្នុងរឿងស្នេហាគេច្រើនបានទទួលជោគជ័យជានិច្ច ។ គេចូលចិត្ដរៀបការយ៉ាងហ៊ឹកហ៊ាក់ហើយការរស់នៅជាមួយគេច្រើនតែបានជួប ប្រទះនឹងរឿងថ្មីជានិច្ចតែរឿងថ្មីទាំងនេះមិនមែនសុទ្ធតែជារឿងសប្បាយទេ ។ គេត្រូវរៀបការជាមួយមនុស្សជំពូកលេខ៥ដូចគ្នាហើយការរួមរស់របស់គេច្រើនតែជួបនឹងរឿងថ្មី ហើយគ្រោតគ្រាតបន្ដិច។",
            "អ្វីៗដែលធ្វើឱ្យមនុស្សបានទទួលជោគជ័យភ្លាមៗដូចជាការប៉ិនប្រសប់ការឈ្លាសវៃនិងការវាយឫកគឺសុទ្ធតែលក្ខណៈរបស់មនុស្សជំពូកលេខ៥ទាំងអស់ ។ ក៏ប៉ុន្ដែ ដោយហេតុថាមនុស្សជំពូកនេះច្រើនជាអ្នករហេចរហាច ខ្វះវិន័យមនុស្សនេះ ច្រើនទទួលជោគជ័យក្នុងមុខរបរណាដែលអាចឱ្យខ្លួនគេសំដែងអំណោយធម្មជាតិព្រមទាំងគំនិតផ្ដើមរបស់គេបាន ។ គេច្រើនសង្កេតឃើញមនុស្សជំពូកលេខ៥ ជាសិល្បករ អ្នកកាសែត អ្នកនិពន្ធ អ្នកបើកបរកប៉ាល់ ជាដើម ។",
            "ចំពោះរឿងលុយកាក់ មនុស្សនេះច្រើនជួបឧបសគ្គ ។ ជួនកាលគេជាមហាសេដ្ឋី ជួនកាលគេក៏ក្ររហាមដែរ ។ ការពិតគេជាអ្នកចាយធំហើយចូលចិត្ដបំពេញចំណូលចិត្ដរបស់ខ្លួនគ្រប់យ៉ាង ដោយគ្មានខ្វល់ថារឿងសប្បាយនោះនឹងឱ្យខ្លួនគេទៅរួចឬក៏ទេឡើយ ។ មនុស្សជំពូកនេះឥតចេះសន្សំលុយកាក់ទាល់តែសោះហើយរឿងរត់ការប្រឡេមប្រឡំក៏អត់ចេះដែរ ។",
        ),
        new Fortune(
            6,
            "ជាអ្នកប្រកបដោយអាត្ម័នថ្លៃថ្នូរហើយសុចរិត ។ គេសំគាល់មនុស្សនេះបានត្រង់មាននិស្ស័យខាងស្រឡាញ់យុត្ដិធម៌និងកាតព្វកិច្ច ។ គេចូលចិត្ដធ្វើល្អនឹង អ្នកដទៃតែចំពោះគ្រួសាររបស់គេវិញ គេហ៊ានលះបង់គ្រប់យ៉ាងដើម្បីផ្គត់ផ្គង់ ។ គេជាអ្នកមានមនៈសិការហើយគត់មត់ពិសេសចំពោះការណាដែលទាក់ទងផ្ទាល់ចំពោះខ្លួនគេ ។ ថ្វីបើគេជាមនុស្សប្រយ័ត្នប្រយែងមិនងាយសំដែងឱ្យឃើញការរំភើបរបស់គេក្ដីក៏គេរាប់អានអ្នកផងដោយរាក់ទាក់បំផុត ។",
            "គេមាននិស្ស័យជាអ្នកស្ងប់ស្ងៀមហើយនឹងធឹងព្រមទាំងស្លូតបូតនិងសោះ អង្គើយជាមួយនឹងអាការៈស្ងប់ស្ងៀមនិងអត់ធ្មត់ ។ មនុស្សជំពូកលេខ៦ច្រើនតែធ្វើឱ្យអ្នកផងរាប់អានណាស់តែក្នុងចំណោមជនខាងក្រោយនេះគ្មានជនណាម្នាក់ហ៊ានអះអាងថាបានស្គាល់គំនិតរបស់មនុស្សឱ្យបាន ច្បាស់លាស់ទេ ។ ការពិតបើមានមនុស្សណាហ៊ានប្រព្រឹត្ដធ្វើឱ្យឆ្គាំឆ្គងលើខ្លួនភ្លាមមនុស្សជំពូកលេខ៦តែងសំដែងប្រតិកម្មដែលគេមិនអាចស្មានទុក ហើយមិន ងាយអត់ឱនឱ្យមនុស្សដែលធ្វើអាក្រក់មកលើខ្លួនទេ ។ គេជាមនុស្សប្រកបដោយឧត្ដមគតិ ឆាប់រំភើប ដឹងហេតុការណ៍មុនជានិច្ច ក៏ប៉ុន្ដែក្នុងជីវិតរបស់ខ្លួន មនុស្សនេះច្រើនជួបការខកចិត្ដណាស់ ។",
            "មនុស្សជំពូកលេខ៦មិនងាយដាក់ចិត្ដស្រឡាញ់គេផ្ដេសផ្ដាសទេតែបើបានជាចាប់ចិត្ដស្រឡាញ់ហើយគឺស្លាប់ទៅយកទៅផង ។ បើបានជារៀបការនឹងអ្នកណាមួយហើយមនុស្សនេះថ្នាក់ថ្នមគេគ្រប់បែបយ៉ាង ហើយមិនព្រមឱ្យគូស្រកររវើរវាយក្រៅពីខ្លួនទេ ។ គំនិតចង់បានតែម្នាក់ឯងនេះជាការមួយមិនគួរគាប់ទេប៉ុន្ដែគូស្រករមិនខ្នក់ចិត្ដ បានឡើយព្រោះគេចេះថ្នាក់ថ្នមនិងស្រស់ស្រាយបំផុត ។ បើរៀបការជាមួយ មនុស្សជំពូកលេខ៦ដូចគ្នា គឺល្អណាស់ ។ ជាមួយលេខ១ក៏បាន តែត្រូវលេខ១ សុខចិត្ដឱ្យលេខ៦ដឹកនាំត្រួតត្រាទើបបាន ។",
            "មនុស្សជំពូកលេខ៦មិនសូវជាអ្នកមានចិត្ដលោភទេអ៊ីចឹងហើយបានគេកើតមកមិនពូកែខាងការជជែកវែកញែកដែលត្រូវការឱ្យមានគំនិតផ្ដួចផ្ដើមនិងបញ្ចេញបញ្ចូល ។ បំណងខាងបញ្ហាមនុស្សតែងជំរុញមនុស្សនេះឱ្យចូលចិត្ដធ្វើការណា ដែលទាក់ទង នឹងសង្គមដូចជាគ្រូពេទ្យឧបការីសង្គមនិងសាស្ដ្រាចារ្យជាដើម ។ និយាយឱ្យចំទៅ មនុស្សជំពូកនេះ កើតមកសម្រាប់តែទទួលជោគជ័យក្នុងវិជ្ជាជីវៈណា ដែលត្រូវការការព្យាយាម ការស្លូតបូត និងគំនិតលះបង់ ។",
            "គេមិនសូវឃើញមនុស្សជំពូកលេខ៦នេះមានទ្រព្យជាដុំកំភួនទេព្រោះមនុស្ស នេះគ្មានចិត្ដស្រេកឃ្លានចង់មានចង់បានឡើយមានប៉ុន្មានស៊ីប៉ុណ្ណឹង ។ គេមិនមែនជាអ្នកចាយវាយរឹកធំទេប៉ុន្ដែគេក៏មិនឱ្យតម្លៃធំទៅលើរឿងលុយកាក់ដែរ ។",
        ),
        new Fortune(
            7,
            "មានប្រាជ្ញាឆ្លាតឆ្លុំឆាប់យល់មិនងាយជឿរឿងអ្វីមួយៗ ដោយងាយទេ ។ បើនឹងជឿលុះណាតែបានពិចារណាបានដិតដល់ណាស់ ។ គេមិនចូលចិត្ដការងារណាដែលមិនស្របនឹងគំនិតប្រាជ្ញារបស់គេទេ ។",
            "ជាអ្នកម៉ឺងម៉ាត់ បើនឹងអារកាត់រឿងអ្វីមួយគេច្រើនតែធ្វើឡើងដោយ វិចារណញ្ញាណគឺមិនមែនដោយផ្លូវចិត្ដទេ ។ គេជាមិត្ដភក្ដិម្នាក់ចេះស្គាល់ទុក្ខធុរៈចេះយោគយល់គ្នាទៅវិញទៅមកមិនងាយប្រកាន់ខឹងតែបើបានជាប្រកាន់ ខឹងហើយក៏មិនងាយជានាវិញដែរ ។ គេជាមនុស្សគួរឱ្យទុកចិត្ដរាប់អានបានព្រោះមិនចូលចិត្ដផ្ដល់ទុក្ខឱ្យអ្នកដទៃ ។",
            "ដោយគេជាមនុស្សមានប្រាជ្ញាគេមិនសូវខកចិត្ដក្នុងរឿងគូស្រករទេគេច្រើន រើសបានគូគាប់ស្របតាមសេចក្ដីប្រាថ្នារបស់គេ ។ គេមិនចូលចិត្ដរើសគូស្រករណាដែលមិនឆ្លាតឆ្លុំឡើយ ។ យកល្អត្រូវរៀបការជាមួយនឹងមនុស្សជំពូកលេខ៩ និងលេខ៤ព្រោះប្រាជ្ញា និងចិត្ដជាអ្នកមនុស្សនិយមមានស្របគ្នា ។ មិនគួររៀបការជាមួយមនុស្សជំពូកលេខ១ទេ ព្រោះច្រើនទាស់ទែងគ្នា ។",
            "មនុស្សនេះចូលចិត្ដស្រឡាញ់ការងារណា ដែលប្រើប្រាជ្ញា ។ គេច្រើនជាសង្គមវិទូ សិល្បករ មេធាវី រដ្ឋបាល ឬពាណិជ្ជករ ។ ជាទូទៅ ក្នុងមុខរបរគេច្រើនបានទទួលជោគជ័យរហ័សណាស់ ។",
            "គេមិនជាអ្នកចាយធូរ តែក៏មិនជាអ្នកកំណាញ់ដែរ ។ កិច្ចការណាត្រូវចាយទើប គេចាយ ។ និយាយឱ្យខ្លីទៅ គឺគេចេះចាយមានមុខមានបែប ។ គេមិនសូវជួបប្រទះនឹងរឿងទាល់លុយកាក់ទេហើយក៏ច្រើនហ៊ានចាយវាយជួយមិត្ដភក្ដិដែលជួបប្រទះនឹងការលំបាកផ្នែកហិរញ្ញវត្ថុទៀតផង ។",
        ),
        new Fortune(
            8,
            "ជាមនុស្សប្រកបដោយកំលាំងខាងឆន្ទៈរកមិនបាន ហើយមានចរិតរឹងដូចដែក ។ ទុកចិត្ដខ្លួនឯងណាស់ហើយបើនឹងកាន់ការអ្វីមួយហើយគឺធ្វើឱ្យទាល់តែបាន សំរេចទើបសុខចិត្ដ ។ មិនចេះសំលុតគេហើយបើជួបប្រទះនឹងការពិបាកអ្វីមួយនៅពេលកំពុងចង់ សំរេចបំណងអ្វីមួយហើយមនុស្សនេះឥតចេះរាថយឬក៏ខកចិត្ដទេគឺពុះពារទាល់ តែបានដល់គោលដៅ ។ ជាទូទៅគឺជាមនុស្សស្អប់ការខ្ជីខ្ជាហើយចរិតនេះសោត ទៀតតែងនាំមនុស្សនេះឱ្យបានជួបជួនជោគជ័យជួនធ្លាក់ទឹក ។ ប៉ុន្ដែទោះជាយ៉ាងណាក៏មិនចេះរារែកដែរ ។",
            "គេជាមនុស្សមានគំនិតប្រយុទ្ធហើយស្វាហាប់ហ៊ានតស៊ូយ៉ាងពេញទំហឹងដើម្បី ការពារឧត្ដមគតិដែលខ្លួនជឿថាល្អ ។ មានចិត្ដលោភលន់ហើយស្វិតស្វាញ ។ បើចង់សំរេចគោលបំណងអ្វីមួយហើយមនុស្សលេខ៨សុខចិត្ដលះបង់គោល បំណងដទៃទៀតចោលសិន ដើម្បីធ្វើគោលបំណងនេះឱ្យទាល់តែបានសំរេច ។ អ៊ីចឹងហើយ បានជាមានអ្នកចូលចិត្ដរាប់អានគេច្រើនណាស់ ។",
            "ក្នុងរឿងស្នេហាមនុស្សជំពូកលេខ៨ ច្រើនប្រែប្រួលមិននឹងហ្នទេ ។ មានម្ង៉ៃថ្នាក់ថ្នមគូគាប់មានម្ង៉ៃទៀតបែបរៀងគេចៗហើយបែបវាហី ។ ដោយហេតុមនុស្សនេះមានចរិតពិបាកបែបនេះមនុស្សជំពូកលេខ៨ ត្រូវរក គូស្រករណាដែលចេះយល់ខ្លួនចេះអត់ឱនចំពោះទឹកមុខប្រែប្រួលគ្មានឈប់ឈរ របស់ខ្លួន ។ ជាទូទៅគួររៀបការជាមួយមនុស្សជំពូកលេខ២ ។ ការពិតភាពស្រស់ស្រាយ និងចិត្ដសន្ដោសរបស់មនុស្សលេខ២តែងមានជោគ ជ័យលើភាពជាអ្នកជិះជាន់របស់មនុស្សជំពូកលេខ៨ ។",
            "ដោយហេតុមាននិស្ស័យខាងគំនិតបង្កើតច្រើន និងប្រកបដោយថាមពល អស្ចារ្យទៀតនោះមនុស្សជំពូកលេខ៨ត្រូវវាសនាចារមកឱ្យបានទទួលជោគជ័យក្នុងកិច្ចការសព្វសារពើ ។ តែធ្វើអ្វីហើយគឺធ្វើដោយមធ្យ័តបំផុត ។",
            "គេជាមនុស្សពូកែខាងយកលុយទៅរកស៊ីណាស់ ។ ទោះជាសម្បត្ដិទ្រព្យរបស់ មានធំឬតូចក៏ដោយឱ្យតែគេប្រកបរបរគេមិនងាយខូចខាតលុយកាក់ទេ ។ មនុស្សធំៗ ជាច្រើនដែលស្ថិតនៅក្នុងជំពូកមនុស្សលេខ៨នេះ ច្រើនរក ទ្រព្យសម្បត្ដិបានស្ដុកស្ដមណាស់ ដោយចាប់រកស៊ីពីគ្មានមួយសេនទៅ ។",
        ),
        new Fortune(
            9,
            "គឺជាមនុស្សប្រកបដោយភាពរំភើបដ៏ជ្រាលជ្រៅនិងមនុស្សធម៌ដ៏អស្ចារ្យ ។ ជាមនុស្សចិត្ដល្អណាស់ឱ្យតែមានគេមកសុំជំនួយភ្លាមគឺជួយគេដោយឥឥតគិត ផលប្រយោជន៍ទេ ។ គេជាអ្នកឧត្ដមគតិនិយមផងប្រលោមនិយមផងអញ្ចឹងហើយបានជាគេជា មនុស្សចូលចិត្ដមើលឃើញអ្នកដទៃល្អហើយស្មោះត្រង់ ។ គឺគេទុកចិត្ដលើ មនុស្សដោយឥឥតរើសមុខ ។",
            "ដោយហេតុគេមាននិស្ស័យស្រស់ស្រាយហើយចូលចំណោមចុះនោះមនុស្សជំពូកលេខ៩តែងមានមិត្ដភក្ដិច្រើនក៏ប៉ុន្ដែគេក៏តែងឃើញមនុស្សនេះមានសត្រូវខ្លះ ដែរ ។ ជាការផ្ទុយដែលជួនកាលមនុស្សនេះមានប្រតិកម្មបែបជាអ្នកការទូតឬក៏ មិននិយាយការពិតប្រាប់គេឯង ។ មិនជាអ្នកម៉ត់ចត់ទេតែទោះជាយ៉ាងណាក៏មនុស្សនេះច្រើនតែធ្វើឱ្យគេមាន សមានចិត្ដមកលើខ្លួនជានិច្ច ។",
            "ជាអ្នកមានចិត្ដស្មោះត្រង់ក្នុងស្នេហាគឺជាគូស្រករដ៏ឧត្ដមថ្វីបើពេលខ្លះមនុស្ស ជំពូកនេះមិនរវីរវល់នឹងការថ្នាក់ថ្នមគ្រួសារព្រោះតែខ្លួនជាប់រវល់ នឹង ប្រយោជន៍ដ៏ច្រើនហើយប្លែកក្ដី ។ យកល្អមនុស្សជំពូកលេខ៩ត្រូវរៀបការជាមួយមនុស្សជំពូកលេខ៩ ដូចគ្នា លេខ៧ ឬលេខ៤ ។ គូស្រករបែបនេះស្គាល់សុខទុក្ខគ្នាណាស់ ដោយហេតុមាន គំនិត និងប្រយោជន៍រួមជាមូលដ្ឋាន ។",
            "មនុស្សជំពូកលេខ៩ ចូលចិត្ដតែការងារណាដែលនាំឱ្យអាចរស់នៅជាមួយអ្នក ផងបានរហូតព្រោះមនុស្សជំពូកនេះ ចូលចិត្ដទាក់ទងនឹងធ្វើសហការជាមួយ អ្នកដទៃណាស់ ។ គេច្រើនតែធ្វើជាចៅក្រម មេធាវី គ្រូពេទ្យ ឬសាស្ដ្រាចារ្យ ។ យកល្អមនុស្សជំពូកលេខ៩ គួរកាន់កាប់មុខរបរទាំងនេះ ។",
            "ក្នុងរឿងរកលុយកាក់មនុស្សជំពូកលេខ៩មិនពូកែទាល់តែសោះ ។ តែគេច្រើនជាមនុស្សមានសំណាងក្នុងរឿងរកលុយកាក់ទៅវិញ ហើយជាមនុស្សចិត្ដល្អ ចំពោះអ្នកខ្វះខាត ។",
        ),
    ];

    $sum     = SumNumber( $n );
    $chapter = $sum % 9 == 0 ? 9 : $sum % 9;

    if ( isset( $_POST[ "submit" ] ) ) {
        if ( $n != "" )
            echo "<p>Your Lucky Number : $chapter</p>";
    }

    if ( isset( $_POST[ "btnPersonality" ] ) ) {
        if ( $n != "" ) {
            echo "<p>Your Lucky Number : $chapter</p>";
            echo "<p>" . $obj[ $chapter - 1 ]->getPersonality() . "</p>";
        }
    }
    if ( isset( $_POST[ "btnSelf" ] ) ) {
        if ( $n != "" ) {
            echo "<p>Your Lucky Number : $chapter</p>";
            echo "<p>" . $obj[ $chapter - 1 ]->getSelf() . "</p>";
        }
    }
    if ( isset( $_POST[ "btnLove" ] ) ) {
        if ( $n != "" ) {
            echo "<p>Your Lucky Number : $chapter</p>";
            echo "<p>" . $obj[ $chapter - 1 ]->getLove() . "</p>";
        }
    }
    if ( isset( $_POST[ "btnJob" ] ) ) {
        if ( $n != "" ) {
            echo "<p>Your Lucky Number : $chapter</p>";
            echo "<p>" . $obj[ $chapter - 1 ]->getJob() . "</p>";
        }
    }
    if ( isset( $_POST[ "btnMoney" ] ) ) {
        if ( $n != "" ) {
            echo "<p>Your Lucky Number : $chapter</p>";
            echo "<p>" . $obj[ $chapter - 1 ]->getMoney() . "</p>";
        }
    }

    //Functions
    function GetNumber( $charecter ) : int
    {
        switch ( strtolower( $charecter ) ) {
            case "a":
            case "j":
            case "s":
                return 1;
                break;
            case "b":
            case "k":
            case "t":
                return 2;
                break;
            case "c":
            case "l":
            case "u":
                return 3;
                break;
            case "d":
            case "m":
            case "v":
                return 4;
                break;
            case "e":
            case "n":
            case "w":
                return 5;
                break;
            case "f":
            case "o":
            case "x":
                return 6;
                break;
            case "g":
            case "p":
            case "y":
                return 7;
                break;
            case "h":
            case "q":
            case "z":
                return 8;
                break;
            case "i":
            case "r":
                return 9;
                break;
            default:
                return 0;
                break;
        }
    }

    function SumNumber( $t ) : int
    {
        $sum = 0;
        for ( $i = 0; $i < strlen( $t ); $i++ ) {
            $num = intval( GetNumber( $t[ $i ] ) );
            $sum = $sum + $num;
        }
        return $sum;
    }
    class Fortune
    {
        private $id;
        private $personality;
        private $self;
        private $love;
        private $job;
        private $money;

        public function __construct( $id, $personality, $self, $love, $job, $money )
        {
            $this->id          = $id;
            $this->personality = $personality;
            $this->self        = $self;
            $this->love        = $love;
            $this->job         = $job;
            $this->money       = $money;
        }

        public function getId()
        {
            return $this->id;
        }
        public function getPersonality()
        {
            return $this->personality;
        }
        public function getSelf()
        {
            return $this->self;
        }
        public function getLove()
        {
            return $this->love;
        }
        public function getJob()
        {
            return $this->job;
        }
        public function getMoney()
        {
            return $this->money;
        }
    }

    ?>
</body>

</html>